<template>
  <div>
    <MoreLines :fullText="fullText" boxWidth="600px" :leastShowLines="7" />
  </div>
</template>

<script>
import MoreLines from './components/MoreLines.vue';

export default {
  components: { MoreLines },
  data () {
    return {
      fullText: '这里是你的长文本内容，可能有很多行，需要判断是有很多行，需要判断需要判断是有很多行，需要判断是有很多行，需要判断是有很多行，否否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断是否溢出这里是你的长文本内容，可能有很多行，需要判断123456',
    };
  },
  props: {
    boxWidth: {
      type: String,
      default: '200px',
    }
  },
  mounted () {
  },
  methods: {},
};  
</script>

<style scoped></style>